# 升職加薪

dict = {
    "Rose":{
        "部門":"科技部",
        "工資":3000,
        "級別":1
    },
    "RAY":{
        "部門":"市場部",
        "工資":5000,
        "級別":2
    },
    "JJ":{
        "部門":"市場部",
        "工資":7000,
        "級別":3
    },"LeBron":{
        "部門":"科技部",
        "工資":4000,
        "級別":1
    },"Zach":{
        "部門":"市場部",
        "工資":6000,
        "級別":2
    }
}

for name in dict:
    if dict[name]["級別"] == 1:
        dict[name]["級別"] += 1
        dict[name]["工資"] += 1000
    print(f"{name}{dict[name]}")